nanoframework/SimpleLink_CC32xx_SDK/ti/drivers/i2s/I2SCC32XX.c
/*
 * Copyright (c) 2019, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>

#ifndef DebugP_ASSERT_ENABLED
#define DebugP_ASSERT_ENABLED 0
#endif
#ifndef DebugP_LOG_ENABLED
#define DebugP_LOG_ENABLED 0
#endif

#include <ti/drivers/dpl/DebugP.h>
#include <ti/drivers/dpl/HwiP.h>

#include <ti/drivers/i2s/I2SCC32XX.h>
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC32XX.h>
#include <ti/drivers/dma/UDMACC32XX.h>
#include <ti/drivers/utils/List.h>

#include <ti/devices/cc32xx/inc/hw_memmap.h>
#include <ti/devices/cc32xx/inc/hw_ocp_shared.h>
#include <ti/devices/cc32xx/inc/hw_ints.h>
#include <ti/devices/cc32xx/inc/hw_mcasp.h>
#include <ti/devices/cc32xx/inc/hw_apps_config.h>
#include <ti/devices/cc32xx/inc/hw_types.h>
#include <ti/devices/cc32xx/driverlib/rom.h>
#include <ti/devices/cc32xx/driverlib/rom_map.h>
#include <ti/devices/cc32xx/driverlib/interrupt.h>
#include <ti/devices/cc32xx/driverlib/i2s.h>
#include <ti/devices/cc32xx/driverlib/prcm.h>
#include <ti/devices/cc32xx/driverlib/udma.h>

#define PinConfigPinMode(config)       (((config) >> 8) & 0xF)
#define PinConfigPin(config)           (((config) >> 0) & 0x3F)
#define PAD_CONFIG_BASE (OCP_SHARED_BASE + OCP_SHARED_O_GPIO_PAD_CONFIG_0)
#define PAD_RESET_STATE 0xC61
#define I2S_NB_CHANNELS_MAX                       8U
#define BYTE_LENGTH                               8U /* Length in bits of a byte*/
#define HWRESOLUTION                              4U /* All the settings are expressed in half-bytes (4 bits) */
#define PRCMI2SCLOCKFREQMIN                       234377 /* Minimum Frequency (in Hz) possible with only one divider */
#define HCLKDIVMAX                                0xFFF  /* Max division of ulHClkDiv (ulHClkDiv is a 12-bit clock divider) */

#define MCASP_RXFMT_RDATDLY_DEFAULT               0x10000 /* This value is the default value to use for RXFMT.RDATDLY */
#define MCASP_TXFMT_XDATDLY_DEFAULT               0x10000 /* This value is the default value to use for TXFMT.XDATDLY */
#define MCASP_RXFMCTL_FRWID_DEFAULT               0x10 /* This value is the default value to use for RXFMCTL.FRWID */
#define MCASP_TXFMCTL_FXWID_DEFAULT               0x10 /* This value is the default value to use for TXFMCTL.FXWID */
#define MCASP_RXFMCTL_RMOD_DEFAULT                0x100 /* This value is the default value to use for RXFMCTL.RMOD */
#define MCASP_TXFMCTL_XMOD_DEFAULT                0x100 /* This value is the default value to use for TXFMCTL.XMOD */
#define MCASP_AHCLKRCTL_HCLKRM_DEFAULT            0x8000 /* This value is the default value to use for AHCLKRCTL.HCLKRM */
#define MCASP_AHCLKXCTL_HCLKXM_DEFAULT            0x8000 /* This value is the default value to use for AHCLKXCTL.HCLKXM */

/*
 * This lookup table is used to configure the DMA channels for the appropriate
 * (8bit, 16bit or 32bit) transfer sizes.
 * Table for an I2S DMA RX channel.
 */
static const uint32_t dmaRxConfig[] = {
    UDMA_SIZE_8  | UDMA_SRC_INC_NONE | UDMA_DST_INC_8,
    UDMA_SIZE_16 | UDMA_SRC_INC_NONE | UDMA_DST_INC_16,
    UDMA_SIZE_32 | UDMA_SRC_INC_NONE | UDMA_DST_INC_32,
};

/*
 * This lookup table is used to configure the DMA channels for the appropriate
 * (8bit, 16bit or 32bit) transfer sizes.
 * Table for an I2S DMA TX channel.
 */
static const uint32_t dmaTxConfig[] = {
    UDMA_SIZE_8  | UDMA_SRC_INC_8  | UDMA_DST_INC_NONE,
    UDMA_SIZE_16 | UDMA_SRC_INC_16 | UDMA_DST_INC_NONE,
    UDMA_SIZE_32 | UDMA_SRC_INC_32 | UDMA_DST_INC_NONE,
};

/*
 * This lookup table is used to configure the DMA channels for the appropriate
 * (8bit, 16bit or 32bit) transfer sizes.
 * Table works for an both RX and TX I2S DMA channels.
 */
#define UDMA_ARBLENGTH_DEFAULT 4
static const uint32_t dmaArbConfig [] = {
    UDMA_ARB_1,
    UDMA_ARB_2,
    UDMA_ARB_4,
    UDMA_ARB_8,
    UDMA_ARB_16,
    UDMA_ARB_32,
    UDMA_ARB_64,
    UDMA_ARB_128,
};

/* Forward declarations */
static bool initObject(I2S_Handle handle, I2S_Params *params);
static void initIO(I2S_Handle handle);
static void initDMA(I2S_Handle handle);
static void initHw(I2S_Handle handle);
static int postNotify(unsigned int eventType, uintptr_t eventArg, uintptr_t clientArg);

static void resetPin(unsigned long pinI2S);
static void openPin(unsigned long pinI2S);
static void restorePinpads(I2SCC32XX_HWAttrs const *hwAttrs);

static void configSCK(I2S_Handle handle);
static void configWS(I2S_Handle handle);
static void configSerialFormat(I2S_Handle handle);
static uint8_t getNumberOfChannels(const uint8_t channelsList);

static void I2S_hwiIntFxn(uintptr_t arg);
static void updateDataReadDMA(uintptr_t arg);
static void updateDataWriteDMA(uintptr_t arg);
static void updateDataReadCPU(uintptr_t arg);
static void updateDataWriteCPU(uintptr_t arg);
static void handleDMATransaction(I2S_Handle handle, I2S_Transaction *transaction, uint32_t transLength, I2SCC32XX_Interface *interface);
static void handleCPUTransaction(I2S_Handle handle, I2S_Transaction **ptrTransaction, I2SCC32XX_Interface *interface);

/* Extern globals */
extern I2S_Config I2S_config[];
extern const uint_least8_t I2S_count;

/* Static globals */
static bool isInitialized = (bool)false;

