nanoframework/SimpleLink_CC32xx_SDK/ti/drivers/i2s/I2SCC32XX.c
/*
 *  ======== I2S_init ========
 */
void I2S_init(void) {
    uint_least8_t i;

    if (!isInitialized) {
        /* Init each instances' driver */
        for (i = 0; i < I2S_count; i++) {
            I2S_Handle handle = (I2S_Handle)&(I2S_config[i]);
            I2SCC32XX_Object *object = (I2SCC32XX_Object *)handle->object;
            object->isOpen = (bool)false;
        }
        /* Init as well UDMA */
        UDMACC32XX_init();
        isInitialized = (bool)true;
    }
}

/*
 *  ======== I2S_open ========
 */
I2S_Handle I2S_open(uint_least8_t index, I2S_Params *params) {
    I2S_Handle        handle;
    I2SCC32XX_Object *object;
    I2SCC32XX_HWAttrs const *hwAttrs;

    handle = (I2S_Handle)&(I2S_config[index]);
    object = handle->object;

    /* Get the pointer to the object and hwAttrs */
    hwAttrs = handle->hwAttrs;

    DebugP_assert(index < I2S_count);

    /* Check if module is initialized. */
    if (!isInitialized ||  object->isOpen) {
        handle =  NULL;
    }
    /* Initialization of the I2S-object and verification of the parameters. */
    else if (!initObject(handle, params)) {
        /* The parameters provided are not correct. */
        handle = NULL;
    }
    /* Set Power, set HW and register interrupts */
    else {
        /* Register HW interrupt */
        HwiP_Params hwiParams;
        HwiP_clearInterrupt(INT_I2S);
        HwiP_Params_init(&hwiParams);
        hwiParams.arg = (uintptr_t)handle;
        hwiParams.priority = hwAttrs->intPriority;
        object->hwi = HwiP_create(INT_I2S, (HwiP_Fxn)I2S_hwiIntFxn, &hwiParams);

        if (object->hwi == NULL) {
            /* HwiP creation failed */
            handle = NULL;
            restorePinpads(hwAttrs);
        }
        else {
            object->isOpen = (bool)true;

            /* Set Power */
            Power_setDependency(PowerCC32XX_PERIPH_I2S);
            MAP_PRCMPeripheralReset(PRCM_I2S);

            /* Set DMA */
            initDMA(handle);

            /* Set HardWare */
            initHw(handle);

            Power_registerNotify(&(object->notifyObj), PowerCC32XX_AWAKE_LPDS, postNotify, (uint32_t)handle);

            MAP_I2SIntDisable(I2S_BASE, 0xFFFFFFFF);

            uintptr_t key = HwiP_disable();
            /* Keep activatedFlags to be modified from somewhere else */
            object->activatedFlag = 0;
            HwiP_restore(key);
        }
    }

    return handle;
}

/*
 *  ======== I2S_close ========
 */
void I2S_close(I2S_Handle handle)
{
    /* Get the pointer to the object and hwAttrs */
    I2SCC32XX_Object *object = handle->object;
    I2SCC32XX_HWAttrs const *hwAttrs = handle->hwAttrs;

    /* Disable interrupts. */
    MAP_I2SIntDisable(I2S_BASE, 0xFFFFFFFF);

    uintptr_t key = HwiP_disable();
    /* Keep activatedFlags to be modified from somewhere else */
    object->activatedFlag = 0;
    HwiP_restore(key);

    /* Close the uDMA */
    if(object->dmaHandle != NULL) {
        UDMACC32XX_close(object->dmaHandle);
        object->dmaHandle = NULL;
    }

    /* Delete the I2S HWI */
    if(object->hwi != NULL) {
        HwiP_delete(object->hwi);
        object->hwi = NULL;
    }

    Power_unregisterNotify(&(object->notifyObj));
    /* Release power dependency - i.e. potentially power down serial domain. */
    Power_releaseDependency(PowerCC32XX_PERIPH_I2S);

    /* Restore pin pads to their reset states */
    restorePinpads(hwAttrs);

    /* Mark the module as available */
    object->isOpen = (bool)false;
}

/*
 *  ======== I2S_setReadQueueHead ========
 */
void I2S_setReadQueueHead(I2S_Handle handle, I2S_Transaction *transaction){

    DebugP_assert(transaction != 0x0);

    I2SCC32XX_Object    *object = handle->object;
    I2SCC32XX_Interface *interface = &object->read;

    interface->activeTransfer = transaction;
}

/*
 *  ======== I2S_setWriteQueueHead ========
 */
void I2S_setWriteQueueHead(I2S_Handle handle, I2S_Transaction *transaction){

    DebugP_assert(transaction != 0x0);

    I2SCC32XX_Object    *object = handle->object;
    I2SCC32XX_Interface *interface = &object->write;

    interface->activeTransfer = transaction;
}

/*
 *  ======== I2S_startClocks ========
 */
void I2S_startClocks(I2S_Handle handle) {

    I2SCC32XX_Object *object = handle->object;

    Power_setConstraint(PowerCC32XX_DISALLOW_LPDS);

    uint8_t mode = ((object->noOfInputs  != 0)? 1:0) << 1 |
                   ((object->noOfOutputs != 0)? 1:0) << 0;

    MAP_I2SIntEnable(I2S_BASE,   I2S_INT_RSYNCERR | I2S_INT_XSYNCERR);

    uintptr_t key = HwiP_disable();
    /* Keep activatedFlags to be modified from somewhere else */
    object->activatedFlag |= I2S_STS_RSYNCERR | I2S_STS_XSYNCERR;
    HwiP_restore(key);

    MAP_I2SEnable(I2S_BASE, (unsigned long)mode);
}

/*
 *  ======== I2S_stopClocks ========
 */
void I2S_stopClocks(I2S_Handle handle) {

    I2SCC32XX_Object *object = handle->object;

    MAP_I2SIntDisable(I2S_BASE,    I2S_INT_RSYNCERR | I2S_INT_XSYNCERR);

    uintptr_t key = HwiP_disable();
    /* Keep activatedFlags to be modified from somewhere else */
    object->activatedFlag &= ~(I2S_STS_RSYNCERR | I2S_STS_XSYNCERR);
    HwiP_restore(key);

    MAP_I2SDisable(I2S_BASE);
    Power_releaseConstraint(PowerCC32XX_DISALLOW_LPDS);
}

/*
 *  ======== I2S_startRead ========
 */
void I2S_startRead(I2S_Handle handle) {

    I2SCC32XX_Object *object = handle->object;
    I2SCC32XX_HWAttrs const *hwAttrs = handle->hwAttrs;
    I2SCC32XX_DataInterface   *SD0;
    I2SCC32XX_DataInterface   *SD1;

    /* Get the pointer to the SD0 and SD1 interfaces */
    SD0 = &object->dataInterfaceSD0;
    SD1 = &object->dataInterfaceSD1;

    if(object->noOfInputs != 0) {

        uintptr_t key = HwiP_disable();
        if(object->isDMAUnused) {
            /* Enable I2S_INT_RDATA | I2S_INT_ROVRN */
            HWREG(I2S_BASE + MCASP_O_EVTCTLR) |= (((I2S_INT_RDATA | I2S_INT_ROVRN) >> 16) & 0xFF);
            object->activatedFlag |= I2S_STS_ROVERN | I2S_STS_RDATA;
            object->updateDataReadFxn((uintptr_t)handle);
        }
        else {
            /* Turn on the DMA channel of the I2S Read interface */
            MAP_uDMAChannelAttributeEnable(hwAttrs->rxChannelIndex,UDMA_ATTR_USEBURST);
            MAP_uDMAChannelAssign(hwAttrs->rxChannelIndex);
            object->updateDataReadFxn((uintptr_t)handle);
            MAP_I2SRxFIFOEnable(I2S_BASE, object->udmaArbLength, object->noOfInputs);

            /* Enable I2S_INT_RDATA | I2S_INT_ROVRN | I2S_INT_RLAST */
            /* Note: we do not activate the I2S_STS_RDMAERR flag (uDMA's responsibility) */
            HWREG(APPS_CONFIG_BASE + APPS_CONFIG_O_DMA_DONE_INT_MASK_CLR ) |= (((I2S_INT_RDATA | I2S_INT_ROVRN | I2S_INT_RLAST) &0xC0000000) >> 20);
            HWREG(I2S_BASE + MCASP_O_EVTCTLR) |= (((I2S_INT_RDATA | I2S_INT_ROVRN | I2S_INT_RLAST) >> 16) & 0xFF);
            object->activatedFlag |= I2S_STS_RLAST | I2S_STS_ROVERN | I2S_STS_RDATA;
        }
        HwiP_restore(key);

        if(SD0->interfaceConfig == I2S_SD0_INPUT) {
            MAP_I2SSerializerConfig(I2S_BASE, SD0->dataLine, I2S_SER_MODE_RX, I2S_INACT_LOW_LEVEL);
        }
        if(SD1->interfaceConfig == I2S_SD1_INPUT) {
            MAP_I2SSerializerConfig(I2S_BASE, SD1->dataLine, I2S_SER_MODE_RX, I2S_INACT_LOW_LEVEL);
        }
    }
}

