nanoframework/SimpleLink_CC32xx_SDK/ti/drivers/i2s/I2SCC32XX.c
/*
 *  ======== I2S_startWrite ========
 */
void I2S_startWrite(I2S_Handle handle) {

    I2SCC32XX_Object *object = handle->object;
    I2SCC32XX_HWAttrs const *hwAttrs = handle->hwAttrs;
    I2SCC32XX_DataInterface *SD0;
    I2SCC32XX_DataInterface *SD1;

    /* Get the pointer to the SD0 and SD1 interfaces */
    SD0 = &object->dataInterfaceSD0;
    SD1 = &object->dataInterfaceSD1;

    if(object->noOfOutputs != 0) {

        uintptr_t key = HwiP_disable();
        if(object->isDMAUnused) {
            /* Enable I2S_INT_XDATA | I2S_INT_XUNDRN */
            HWREG(I2S_BASE + MCASP_O_EVTCTLX) |= ((I2S_INT_XDATA | I2S_INT_XUNDRN) & 0xFF);
            object->activatedFlag |= I2S_STS_XDATA | I2S_STS_XUNDRN;
            object->updateDataWriteFxn((uintptr_t)handle);
        }
        else {
            /* Turn on the DMA channel of the I2S Write interface */
            MAP_uDMAChannelAttributeEnable(hwAttrs->txChannelIndex,UDMA_ATTR_USEBURST);
            MAP_uDMAChannelAssign(hwAttrs->txChannelIndex);
            object->updateDataWriteFxn((uintptr_t)handle);
            MAP_I2STxFIFOEnable(I2S_BASE, object->udmaArbLength, object->noOfOutputs);

            /* Enable I2S_INT_XDATA | I2S_INT_XLAST | I2S_INT_XUNDRN */
            /* Note: we do not activate the I2S_STS_XDMAERR flag (uDMA's responsibility) */
            HWREG(APPS_CONFIG_BASE + APPS_CONFIG_O_DMA_DONE_INT_MASK_CLR ) |= (((I2S_INT_XDATA | I2S_INT_XLAST | I2S_INT_XUNDRN) &0xC0000000) >> 20);
            HWREG(I2S_BASE + MCASP_O_EVTCTLX) |= ((I2S_INT_XDATA | I2S_INT_XLAST | I2S_INT_XUNDRN) & 0xFF);
            object->activatedFlag |= I2S_STS_XLAST | I2S_STS_XUNDRN | I2S_STS_XDATA;
        }
        HwiP_restore(key);

        if(SD0->interfaceConfig == I2S_SD0_OUTPUT) {
            MAP_I2SSerializerConfig(I2S_BASE, SD0->dataLine, I2S_SER_MODE_TX, I2S_INACT_LOW_LEVEL);
        }
        if(SD1->interfaceConfig == I2S_SD1_OUTPUT) {
            MAP_I2SSerializerConfig(I2S_BASE, SD1->dataLine, I2S_SER_MODE_TX, I2S_INACT_LOW_LEVEL);
        }
    }
}

/*
 *  ======== I2S_stopRead ========
 */
void I2S_stopRead(I2S_Handle handle) {

    I2SCC32XX_Object *object = handle->object;
    I2SCC32XX_HWAttrs const *hwAttrs = handle->hwAttrs;
    I2SCC32XX_DataInterface *SD0;
    I2SCC32XX_DataInterface *SD1;

    /* Get the pointer to the SD0 and SD1 interfaces*/
    SD0 = &object->dataInterfaceSD0;
    SD1 = &object->dataInterfaceSD1;

    MAP_I2SIntDisable(I2S_BASE,    I2S_INT_RDATA | I2S_INT_ROVRN );

    uintptr_t key = HwiP_disable();
    /* Keep activatedFlag to be modified from somewhere else */
    object->activatedFlag &= ~(I2S_STS_RDATA | I2S_STS_ROVERN);
    HwiP_restore(key);

    if(!object->isDMAUnused) {
        /* RLAST is activated only for transfers in DMA mode */
        MAP_I2SIntDisable(I2S_BASE,    I2S_INT_RLAST);
        key = HwiP_disable();
        object->activatedFlag &= ~(I2S_STS_RLAST);
        HwiP_restore(key);

        /* Wait the end of the current transfer to close properly the DMA channel*/
        while(MAP_uDMAChannelModeGet(hwAttrs->rxChannelIndex) != UDMA_MODE_STOP);
        MAP_I2SRxFIFODisable(I2S_BASE);
    }

    if(SD0->interfaceConfig == I2S_SD0_INPUT) {
        MAP_I2SSerializerConfig(I2S_BASE, SD0->dataLine, I2S_SER_MODE_DISABLE, I2S_INACT_LOW_LEVEL);
    }
    if(SD1->interfaceConfig == I2S_SD1_INPUT) {
        MAP_I2SSerializerConfig(I2S_BASE, SD1->dataLine, I2S_SER_MODE_DISABLE, I2S_INACT_LOW_LEVEL);
    }
}

/*
 *  ======== I2S_stopWrite ========
 */
void I2S_stopWrite(I2S_Handle handle) {

    I2SCC32XX_Object *object = handle->object;
    I2SCC32XX_HWAttrs const *hwAttrs = handle->hwAttrs;
    I2SCC32XX_DataInterface *SD0;
    I2SCC32XX_DataInterface *SD1;

    /* Get the pointer to the SD0 and SD1 interfaces*/
    SD0 = &object->dataInterfaceSD0;
    SD1 = &object->dataInterfaceSD1;

    MAP_I2SIntDisable(I2S_BASE,    I2S_INT_XDATA | I2S_INT_XUNDRN);

    uintptr_t key = HwiP_disable();
    /* Keep activatedFlag to be modified from somewhere else */
    object->activatedFlag &= ~(I2S_STS_XDATA | I2S_STS_XUNDRN);
    HwiP_restore(key);

    if(!object->isDMAUnused) {
        /* XLAST is activated only for transfers in DMA mode */
        MAP_I2SIntDisable(I2S_BASE,    I2S_INT_XLAST);
        key = HwiP_disable();
        object->activatedFlag &= ~(I2S_STS_XLAST);
        HwiP_restore(key);

        /* Wait the end of the current transfer to close properly the DMA channel*/
        while(MAP_uDMAChannelModeGet(hwAttrs->txChannelIndex) != UDMA_MODE_STOP);
        MAP_I2STxFIFODisable(I2S_BASE);
    }

    if(SD0->interfaceConfig == I2S_SD0_OUTPUT) {
        MAP_I2SSerializerConfig(I2S_BASE, SD0->dataLine, I2S_SER_MODE_DISABLE, I2S_INACT_LOW_LEVEL);
    }
    if(SD1->interfaceConfig == I2S_SD1_OUTPUT) {
        MAP_I2SSerializerConfig(I2S_BASE, SD1->dataLine, I2S_SER_MODE_DISABLE, I2S_INACT_LOW_LEVEL);
    }
}

/*
*  ======== initHw ========
*  This functions initializes the I2S hardware module.
*
*  @pre    Function assumes that the I2S handle is pointing to a hardware
*          module which has already been opened.
*/
static void initHw(I2S_Handle handle) {

    /* Configure IOs */
    initIO(handle);
    /* Configure SCK clock (including sampling edge) */
    configSCK(handle);
    /* Configure WS clock (including WS inversion) */
    configWS(handle);
    /* Configure serial format (data-length, DMA use, MSB/LSB first, data padding, channels activated) */
    configSerialFormat(handle);
}

/*
 *  ======== I2S_hwiIntFxn ========
 *  Hwi function that processes I2S interrupts.
 */
static void I2S_hwiIntFxn(uintptr_t arg) {

    I2S_Handle handle = (I2S_Handle)arg;
    I2SCC32XX_Object const *object = handle->object;
    uint16_t errStatus = 0U;

    /* Read and clear all the interrupt flags */
    /* Note: in CPU mode, RDATA and XDATA flags must be cleared AFTER data update */
    uint32_t rawInterruptStatus = (uint32_t)MAP_I2SIntStatus(I2S_BASE);
    if(object->isDMAUnused) {
        MAP_I2SIntClear(I2S_BASE,  rawInterruptStatus & ~I2S_STS_RDATA & ~I2S_STS_XDATA);
    }
    else {
        MAP_I2SIntClear(I2S_BASE, rawInterruptStatus);
    }

    /* Filter the interrupt-status to only consider the activated flags */
    uint32_t interruptStatus = (rawInterruptStatus & object->activatedFlag);


    /* Normal work */
    if((interruptStatus & (uint32_t)(I2S_STS_RLAST | I2S_STS_RDATA)) != 0U)
    {
        object->updateDataReadFxn(arg);
    }

    if((interruptStatus & (uint32_t)(I2S_STS_XLAST | I2S_STS_XDATA)) != 0U)
    {
        object->updateDataWriteFxn(arg);
    }

    /* Read errors */
    if((interruptStatus & (uint32_t)I2S_STS_ROVERN  ) != 0U)
    {
        errStatus |= I2S_PTR_READ_ERROR;
    }

    if((interruptStatus & (uint32_t)I2S_STS_RSYNCERR) != 0U)
    {
        errStatus |= I2S_TIMEOUT_ERROR;
    }

    if((interruptStatus & (uint32_t)I2S_STS_RDMAERR ) != 0U)
    {
        errStatus |= I2S_BUS_ERROR;
    }

    /* Write errors */
    if((interruptStatus & (uint32_t)I2S_STS_XUNDRN  ) != 0U)
    {
        errStatus |= I2S_PTR_WRITE_ERROR;
    }

    if((interruptStatus & (uint32_t)I2S_STS_XSYNCERR) != 0U)
    {
        errStatus |= I2S_WS_ERROR;
    }

    if((interruptStatus & (uint32_t)I2S_STS_XDMAERR ) != 0U)
    {
        errStatus |= I2S_BUS_ERROR;
    }

    /* Triggering of the error-Callback (only one call, with potentially several status bits activated) */
    if(errStatus != 0U) {
        object->errorCallback(handle, errStatus, NULL);
    }
}

