nanoframework/SimpleLink_CC32xx_SDK/ti/drivers/i2s/I2SCC32XX.c
/*
 *  ======== updateDataReadDMA ========
 */
static void updateDataReadDMA(uintptr_t arg) {
    I2S_Handle handle = (I2S_Handle)arg;
    I2SCC32XX_Object *object = handle->object;
    I2SCC32XX_HWAttrs const *hwAttrs = handle->hwAttrs;

    /* Wait for the mode to be changed to "stopped" */
    if(MAP_uDMAChannelModeGet(hwAttrs->rxChannelIndex) == UDMA_MODE_STOP){

        I2S_Transaction *transaction = (I2S_Transaction *)object->read.activeTransfer;
        if(transaction != NULL) {

            uint32_t transLength = transaction->bufSize - transaction->bytesTransferred;   /* transfer length expressed in bytes */
            transLength = transLength / (object->memorySlotLength / BYTE_LENGTH);          /* expressed in number of samples (number of atomic DMA transfers) */
            transLength = transLength - (transLength % object->udmaArbLength);             /* taking in consideration the limitation of the DMA (DMA copies each time UDMA_ARB_x samples) */

            MAP_uDMAChannelControlSet(hwAttrs->rxChannelIndex,
                                  object->read.udmaConfig);
            MAP_uDMAChannelTransferSet(hwAttrs->rxChannelIndex,
                                   UDMA_MODE_BASIC,
                                   (void *)I2S_RX_DMA_PORT,
                                   (void *)((uint32_t)transaction->bufPtr + transaction->bytesTransferred),
                                   transLength);

            MAP_uDMAChannelEnable(hwAttrs->rxChannelIndex);

            handleDMATransaction(handle, transaction, transLength, &object->read);
        }
    }
}

/*
 *  ======== updateDataWriteDMA ========
 */
static void updateDataWriteDMA(uintptr_t arg) {
    I2S_Handle handle = (I2S_Handle)arg;
    I2SCC32XX_Object *object = handle->object;
    I2SCC32XX_HWAttrs const *hwAttrs = handle->hwAttrs;

    /* Wait for the mode to be changed to "stopped" */
    if(MAP_uDMAChannelModeGet(hwAttrs->txChannelIndex) == UDMA_MODE_STOP){

        I2S_Transaction *transaction = (I2S_Transaction *)object->write.activeTransfer;
        if(transaction != NULL) {

            uint32_t transLength = transaction->bufSize - transaction->bytesTransferred;    /* transfer length expressed in bits */
            transLength = transLength / (object->memorySlotLength / BYTE_LENGTH);           /* expressed in number of samples (number of atomic DMA transfers) */
            transLength = transLength - (transLength % object->udmaArbLength);              /* taking in consideration the limitation of the DMA (DMA copies each time UDMA_ARB_x samples) */

            MAP_uDMAChannelControlSet(hwAttrs->txChannelIndex,
                                  object->write.udmaConfig);
            MAP_uDMAChannelTransferSet(hwAttrs->txChannelIndex,
                                   UDMA_MODE_BASIC,
                                   (void *)((uint32_t)transaction->bufPtr + transaction->bytesTransferred),
                                   (void *)I2S_TX_DMA_PORT,
                                   transLength);

            MAP_uDMAChannelEnable(hwAttrs->txChannelIndex);

            handleDMATransaction(handle, transaction, transLength, &object->write);
        }
    }
}

/*
 *  ======== handleDMATransaction ========
 *  This function avoid to duplicate the code dedicated to take care of the transactions in DMA mode.
 *  This function remove the transaction from the list and trigger the user callback.
 *
 */
static void handleDMATransaction(I2S_Handle      handle,
                                 I2S_Transaction *transactionFinished,
                                 uint32_t        transLength,
                                 I2SCC32XX_Interface   *interface){

    I2SCC32XX_Object *object = handle->object;

    /* As we already start this transaction, is no longer required to be considered */
    interface->activeTransfer = (I2S_Transaction*)List_next(&transactionFinished->queueElement);

    transactionFinished->untransferredBytes = transactionFinished->bufSize - (transLength * (object->memorySlotLength / BYTE_LENGTH));
    transactionFinished->numberOfCompletions ++;
    transactionFinished->bytesTransferred = 0;

    if(interface->activeTransfer == NULL) {
        interface->callback(handle, I2S_ALL_TRANSACTIONS_SUCCESS, transactionFinished);
    }
    else {
        interface->callback(handle, I2S_TRANSACTION_SUCCESS, transactionFinished);
    }
}


/*
 *  ======== updateDataReadCPU ========
 */
static void updateDataReadCPU(uintptr_t arg) {
    I2S_Handle handle = (I2S_Handle)arg;
    I2SCC32XX_Object *object = handle->object;
    I2SCC32XX_DataInterface   *SD0;
    I2SCC32XX_DataInterface   *SD1;

    /* Get the pointer to the SD0 and SD1 interfaces*/
    SD0 = &object->dataInterfaceSD0;
    SD1 = &object->dataInterfaceSD1;

    I2S_Transaction *transaction = (I2S_Transaction *)object->read.activeTransfer;
    if(transaction != NULL) {

        bool dataKO = (bool)false;
        uint32_t *ptrValue;
        ptrValue = (uint32_t*)((uint32_t)transaction->bufPtr + (uint32_t)transaction->bytesTransferred);

        while((!dataKO) && (transaction != NULL)) {

            if((SD0->interfaceConfig == I2S_SD0_INPUT) && (transaction != NULL) && (!dataKO)) {

                dataKO |= MAP_I2SDataGetNonBlocking(I2S_BASE, SD0->dataLine, (unsigned long*)ptrValue);

                if(!dataKO) {

                    handleCPUTransaction(handle, &transaction, &object->read);

                    ptrValue = (uint32_t*)((uint32_t)transaction->bufPtr + (uint32_t)transaction->bytesTransferred);
                }
            }

            if((SD1->interfaceConfig == I2S_SD1_INPUT) && (transaction != NULL) && (!dataKO)) {

                dataKO |= MAP_I2SDataGetNonBlocking(I2S_BASE, SD1->dataLine, (unsigned long*)ptrValue);

                if(!dataKO) {

                    handleCPUTransaction(handle, &transaction, &object->read);

                    ptrValue = (uint32_t*)((uint32_t)transaction->bufPtr + (uint32_t)transaction->bytesTransferred);
                }
            }
        }
    }

