nanoframework/SimpleLink_CC32xx_SDK/ti/drivers/i2s/I2SCC32XX.c
    /* In CPU mode interrupt clearing must be done AFTER data update */
    MAP_I2SIntClear(I2S_BASE,I2S_STS_RDATA);
}

/*
 *  ======== updateDataWriteCPU ========
 */
static void updateDataWriteCPU(uintptr_t arg) {
    I2S_Handle handle = (I2S_Handle)arg;
    I2SCC32XX_Object *object = handle->object;
    I2SCC32XX_DataInterface   *SD0;
    I2SCC32XX_DataInterface   *SD1;

    /* Get the pointer to the SD0 and SD1 interfaces*/
    SD0 = &object->dataInterfaceSD0;
    SD1 = &object->dataInterfaceSD1;

    I2S_Transaction *transaction = (I2S_Transaction *)object->write.activeTransfer;
    if(transaction != NULL) {

        bool dataKO = (bool)false;
        uint32_t Value;
        uint32_t *ptrValue = &Value;
        ptrValue = (uint32_t*)((uint32_t)transaction->bufPtr + (uint32_t)transaction->bytesTransferred);
        Value = *ptrValue;

        while((!dataKO) && (transaction != NULL)) {

            if((SD0->interfaceConfig == I2S_SD0_OUTPUT) && (transaction != NULL) && (!dataKO)) {

                dataKO |= MAP_I2SDataPutNonBlocking(I2S_BASE, SD0->dataLine, Value);

                if(!dataKO) {

                    handleCPUTransaction(handle, &transaction, &object->write);

                    ptrValue = (uint32_t*)((uint32_t)transaction->bufPtr + (uint32_t)transaction->bytesTransferred);
                    Value = *ptrValue;
                }
            }

            if((SD1->interfaceConfig == I2S_SD1_OUTPUT) && (transaction != NULL) && (!dataKO)) {

                dataKO |= MAP_I2SDataPutNonBlocking(I2S_BASE, SD1->dataLine, Value);

                if(!dataKO) {

                    handleCPUTransaction(handle, &transaction, &object->write);

                    ptrValue = (uint32_t*)((uint32_t)transaction->bufPtr + (uint32_t)transaction->bytesTransferred);
                    Value = *ptrValue;
                }
            }
        }
    }

    /* In CPU mode interrupt clearing must be done AFTER data update */
    MAP_I2SIntClear(I2S_BASE,I2S_STS_XDATA);
}

/*
 *  ======== handleCPUTransaction ========
 *  This function avoid to duplicate the code dedicated to take care of the transactions in CPU mode.
 *  If needed, this function remove the transaction from the list and trigger the user callback.
 */
static void handleCPUTransaction(I2S_Handle handle,
                                 I2S_Transaction **ptrTransaction,
                                 I2SCC32XX_Interface *interface){

    I2SCC32XX_Object const *object = handle->object;
    I2S_Transaction *transaction = *ptrTransaction;

    transaction->bytesTransferred += object->memorySlotLength / BYTE_LENGTH;

    if(transaction->bytesTransferred >= transaction->bufSize){

        /* We note the transaction as finished */
        transaction->numberOfCompletions ++;
        transaction->untransferredBytes = transaction->bufSize - transaction->bytesTransferred;
        transaction->bytesTransferred = 0;

        /* We now take in consideration the next transaction */
        interface->activeTransfer = (I2S_Transaction*)List_next(&transaction->queueElement);
        *ptrTransaction = (I2S_Transaction*)interface->activeTransfer; /* transaction pointer must be updated because
                                                                        * it is potentially reused by the calling function */

        I2S_Transaction *newTransaction = *ptrTransaction;
        if(List_next(&newTransaction->queueElement) == NULL) {
            interface->callback(handle, I2S_ALL_TRANSACTIONS_SUCCESS, transaction);
        }
        else {
            interface->callback(handle, I2S_TRANSACTION_SUCCESS, transaction);
        }
    }
}

/*
 *  ======== initObject ========
 */
static bool initObject(I2S_Handle handle, I2S_Params *params) {

    I2SCC32XX_Object          *object = handle->object;
    I2SCC32XX_DataInterface   *SD0;
    I2SCC32XX_DataInterface   *SD1;

    uint8_t indexDmaConfig = 0;
    uint8_t indexDmaArbConfig = 0;

    bool retVal = (bool)true;

    /* Get the pointer to the SD0 and SD1 interfaces*/
    SD0 = &object->dataInterfaceSD0;
    SD1 = &object->dataInterfaceSD1;

    object->moduleRole           = params->moduleRole;
    object->invertWS             = params->invertWS;
    object->samplingEdge         = params->samplingEdge;
    object->isMSBFirst           = params->isMSBFirst;
    object->samplingFrequency    = params->samplingFrequency;

    DebugP_assert(params->memorySlotLength == I2S_MEMORY_LENGTH_8BITS  ||
                  params->memorySlotLength == I2S_MEMORY_LENGTH_16BITS ||
                  params->memorySlotLength == I2S_MEMORY_LENGTH_24BITS ||
                  params->memorySlotLength == I2S_MEMORY_LENGTH_32BITS   );

    if(!params->isDMAUnused){
        if(object->memorySlotLength <= I2S_MEMORY_LENGTH_8BITS){
            indexDmaConfig = 0;
            object->memorySlotLength = I2S_MEMORY_LENGTH_8BITS;
        }
        else if(object->memorySlotLength <= I2S_MEMORY_LENGTH_16BITS){
            indexDmaConfig = 1;
            object->memorySlotLength = I2S_MEMORY_LENGTH_16BITS;
        }
        else if(object->memorySlotLength <= I2S_MEMORY_LENGTH_32BITS){
            indexDmaConfig = 2;
            object->memorySlotLength = I2S_MEMORY_LENGTH_32BITS;
        }
        else {
            retVal = (bool)false;
        }
    }
    else {
        indexDmaConfig = 0;
        object->memorySlotLength = params->memorySlotLength;
    }

    /* Computation of the sampleMask and the sampleRotation (to achieve before and after word padding) */
    if(params->beforeWordPadding + params->bitsPerWord + params->afterWordPadding <= 32) {
        object->dataLength      = params->beforeWordPadding + params->bitsPerWord + params->afterWordPadding;

        /* This is the default setting. Data are right aligned. */
        object->sampleMask      = 0xFFFFFFFF >> (32-object->memorySlotLength);
        object->sampleRotation  = (object->dataLength / HWRESOLUTION) % BYTE_LENGTH;

        /* Data truncation is made by masking the LSB of the samples. Data are still right aligned. */
        if(params->bitsPerWord < object->memorySlotLength) {
            object->sampleMask &= (0xFFFFFFFF << (object->memorySlotLength - params->bitsPerWord));
            object->sampleRotation += ((object->memorySlotLength - params->bitsPerWord) / HWRESOLUTION) % BYTE_LENGTH;
        }

        /* Data padding is made by increasing the left rotation (i.e. decreasing right rotation) */
        if(params->bitsPerWord > object->memorySlotLength) {
            object->sampleRotation -= ((params->bitsPerWord - object->memorySlotLength) / HWRESOLUTION) % BYTE_LENGTH;
        }

        /* After word padding is made by increasing the left rotation (i.e. decreasing right rotation) */
        if(params->afterWordPadding) {
            object->sampleRotation -= (params->afterWordPadding / HWRESOLUTION) % BYTE_LENGTH;
        }
    }
    else {
        retVal = (bool)false;
    }

    object->isDMAUnused          = params->isDMAUnused;
    if(object->isDMAUnused) {
        object->updateDataReadFxn  = updateDataReadCPU;
        object->updateDataWriteFxn = updateDataWriteCPU;
    }
    else {
        object->updateDataReadFxn  = updateDataReadDMA;
        object->updateDataWriteFxn = updateDataWriteDMA;
    }

    SD0->interfaceConfig      = params->SD0Use;
    SD0->channelsUsed         = params->SD0Channels;
    SD0->numberOfChannelsUsed = getNumberOfChannels((uint8_t)SD0->channelsUsed);
    SD0->dataLine             = I2S_DATA_LINE_0;
    SD1->interfaceConfig      = params->SD1Use;
    SD1->channelsUsed         = params->SD1Channels;
    SD1->numberOfChannelsUsed = getNumberOfChannels((uint8_t)SD1->channelsUsed);
    SD1->dataLine             = I2S_DATA_LINE_1;

    object->noOfInputs          =   ((SD0->interfaceConfig == I2S_SD0_INPUT)? 1: 0)
                                  + ((SD1->interfaceConfig == I2S_SD1_INPUT)? 1: 0);
    object->noOfOutputs         =   ((SD0->interfaceConfig == I2S_SD0_OUTPUT)? 1: 0)
                                  + ((SD1->interfaceConfig == I2S_SD1_OUTPUT)? 1: 0);

    /* Here we are looking for the biggest possible  uDMA arbitration length */
    if(params->fixedBufferLength == 0) {
        retVal = (bool)false;
    }
    else {
        if(params->fixedBufferLength != 1) {
            uint16_t const fixedBufferLength = (params->fixedBufferLength /(object->memorySlotLength/BYTE_LENGTH));
            int i;

            /* The udmaArbLength minimum value is 2 (= 2^1)*/
            object->udmaArbLength = 2;
            /* The udmaArbLength maximum value is 16 (= 2^4)*/
            for(i=2; i<=4; i++) {
                if(fixedBufferLength % (1 << i) == 0) {
                    object->udmaArbLength = 1 << i;
                }
            }
        }
        else {
            object->udmaArbLength = UDMA_ARBLENGTH_DEFAULT;
        }
    }

    /* Authorized Arbitration values are limited to 2, 4, 8, 16 */
    DebugP_assert(object->udmaArbLength == 2  ||
                  object->udmaArbLength == 4  ||
                  object->udmaArbLength == 8  ||
                  object->udmaArbLength == 16   );

