nanoframework/SimpleLink_CC32xx_SDK/ti/drivers/i2s/I2SCC32XX.c
    int i;
    for(i=0; i<BYTE_LENGTH; i++) {
        if(object->udmaArbLength == (1 << i)) {
            indexDmaArbConfig = i;
        }
    }

    object->read.udmaConfig = dmaRxConfig[indexDmaConfig] | dmaArbConfig[indexDmaArbConfig];
    object->read.callback = params->readCallback;
    if((object->read.callback == NULL) && (object->noOfInputs != 0U)) {
        retVal = (bool)false;
    }

    object->write.udmaConfig = dmaTxConfig[indexDmaConfig] | dmaArbConfig[indexDmaArbConfig];
    object->write.callback = params->writeCallback;
    if((object->write.callback == NULL) && (object->noOfOutputs != 0U)) {
        retVal = (bool)false;
    }

    object->errorCallback = params->errorCallback;
    if((object->errorCallback == NULL)) {
        retVal = (bool)false;
    }

    object->read.activeTransfer   = NULL;
    object->write.activeTransfer  = NULL;

    return retVal;
}

/*
 *  ======== initIO ========
 */
static void initIO(I2S_Handle handle) {

    I2SCC32XX_HWAttrs const   *hwAttrs;

    /* Get the pointer to the object and hwAttrs */
    hwAttrs = handle->hwAttrs;

    DebugP_assert(hwAttrs->pinSD1 == I2SCC32XX_PIN_50_SD1 ||
                  hwAttrs->pinSD1 == I2SCC32XX_PIN_60_SD1 ||
                  hwAttrs->pinSD1 == I2SCC32XX_PIN_UNUSED);

    DebugP_assert(hwAttrs->pinSD0 == I2SCC32XX_PIN_45_SD0 ||
                  hwAttrs->pinSD0 == I2SCC32XX_PIN_50_SD0 ||
                  hwAttrs->pinSD0 == I2SCC32XX_PIN_52_SD0 ||
                  hwAttrs->pinSD0 == I2SCC32XX_PIN_64_SD0 ||
                  hwAttrs->pinSD0 == I2SCC32XX_PIN_UNUSED);

    DebugP_assert(hwAttrs->pinSCK == I2SCC32XX_PIN_03_SCK ||
                  hwAttrs->pinSCK == I2SCC32XX_PIN_52_SCK ||
                  hwAttrs->pinSCK == I2SCC32XX_PIN_53_SCK ||
                  hwAttrs->pinSCK == I2SCC32XX_PIN_UNUSED);

    DebugP_assert(hwAttrs->pinWS  == I2SCC32XX_PIN_02_WS ||
                  hwAttrs->pinWS  == I2SCC32XX_PIN_15_WS ||
                  hwAttrs->pinWS  == I2SCC32XX_PIN_17_WS ||
                  hwAttrs->pinWS  == I2SCC32XX_PIN_21_WS ||
                  hwAttrs->pinWS  == I2SCC32XX_PIN_45_WS ||
                  hwAttrs->pinWS  == I2SCC32XX_PIN_53_WS ||
                  hwAttrs->pinWS  == I2SCC32XX_PIN_63_WS);

    DebugP_assert(hwAttrs->pinSD1 == I2SCC32XX_PIN_62_SCKX ||
                  hwAttrs->pinSD1 == I2SCC32XX_PIN_UNUSED);

    openPin(hwAttrs->pinSD1);
    openPin(hwAttrs->pinSD0);
    openPin(hwAttrs->pinSCK);
    openPin(hwAttrs->pinSCKX);
    openPin(hwAttrs->pinWS);
}

/*
 *  ======== openPin ========
 */
static void openPin(unsigned long pinI2S) {

    if(pinI2S != I2SCC32XX_PIN_UNUSED) {
        MAP_PinTypeI2S((unsigned long)PinConfigPin(pinI2S),
                   (unsigned long)PinConfigPinMode(pinI2S));
    }
}

/*
 *  ======== resetPin ========
 */
static void resetPin(unsigned long pinI2S) {

    if(pinI2S != I2SCC32XX_PIN_UNUSED) {
        uint32_t padRegister = (PinToPadGet((pinI2S) & 0x3f)<<2) + PAD_CONFIG_BASE;
        HWREG(padRegister) = PAD_RESET_STATE;
    }
}

/*
 *  ======== restorePinpads ========
 */
static void restorePinpads(I2SCC32XX_HWAttrs const *hwAttrs){
    resetPin(hwAttrs->pinSD1);
    resetPin(hwAttrs->pinSD0);
    resetPin(hwAttrs->pinSCK);
    resetPin(hwAttrs->pinSCKX);
    resetPin(hwAttrs->pinWS);
}

/*
 *  ======== initDMA ========
 */
static void initDMA(I2S_Handle handle) {

    I2SCC32XX_Object *object;
    object  = handle->object;

    if(!object->isDMAUnused) {

        object->dmaHandle = UDMACC32XX_open();
    }
}

/*
 *  ======== getNumberOfChannels ========
 */
static uint8_t getNumberOfChannels(const uint8_t channelsList) {

    uint8_t i = 0;
    uint8_t nbChannelsUsed = 0;
    for(i=0; i<(I2S_NB_CHANNELS_MAX); i++) {
        if(((channelsList >> i) & 1U) == 1U) {
            nbChannelsUsed ++;
        }
    }
    return nbChannelsUsed;
}

/*
 *  ======== configSCK ========
 */
static void configSCK(I2S_Handle handle) {

    I2SCC32XX_Object const *object;

    /* Get the pointer to the object*/
    object = handle->object;

    /* There are three freq dividers (one in the PRCM module, two in the I2S module).
     * Two of the three freq dividers are used to keep the possibility to activate
     * only the input (or only the output).
     * Smallest SCK frequency possible is 57 Hz. */
    unsigned long ulI2SClk  = object->samplingFrequency * object->dataLength * 2;
    unsigned long ulBitClk  = (ulI2SClk < PRCMI2SCLOCKFREQMIN)? PRCMI2SCLOCKFREQMIN : ulI2SClk;
    MAP_PRCMI2SClockFreqSet(ulBitClk);

    /* Calculate remaining divider */
    unsigned long remainingDivider = ((ulBitClk + ulI2SClk/2) / ulI2SClk); /* We want to round the integer division: ROUND(a/b)=(a+b/2)/b */;
    unsigned long ulHClkDiv = (remainingDivider == 0)? 0 :(remainingDivider-1);
    ulHClkDiv = (ulHClkDiv > HCLKDIVMAX)? HCLKDIVMAX : ulHClkDiv;
    unsigned long ulClkDiv  = 0; /* ulClkDiv is not activated */

    HWREG(I2S_BASE + MCASP_O_AHCLKXCTL) = (MCASP_AHCLKXCTL_HCLKXM_DEFAULT|ulHClkDiv);
    if(object->noOfOutputs != 0) {

        HWREG(I2S_BASE + MCASP_O_ACLKXCTL)  = (((object->samplingEdge << 7)   & MCASP_ACLKXCTL_CLKXP) |
                                               ((object->moduleRole   << 5)   & MCASP_ACLKXCTL_CLKXM) |
                                               ((ulClkDiv             << 0)   & MCASP_ACLKXCTL_CLKXDIV_M));
    }

    HWREG(I2S_BASE + MCASP_O_AHCLKRCTL) = (MCASP_AHCLKRCTL_HCLKRM_DEFAULT|ulHClkDiv);
    if(object->noOfInputs != 0) {

        HWREG(I2S_BASE + MCASP_O_ACLKRCTL)  = (((object->samplingEdge << 7)   & MCASP_ACLKRCTL_CLKRP) |
                                               ((object->moduleRole   << 5)   & MCASP_ACLKRCTL_CLKRM) |
                                               ((ulClkDiv             << 0)   & MCASP_ACLKRCTL_CLKRDIV_M));
    }


}

/*
 *  ======== configWS ========
 */
static void configWS(I2S_Handle handle) {

    I2SCC32XX_Object const *object;

    /* Get the pointer to the object*/
    object = handle->object;

    if(object->noOfInputs != 0) {
        HWREG(I2S_BASE + MCASP_O_RXFMCTL) =  (  MCASP_RXFMCTL_RMOD_DEFAULT                       |
                                                MCASP_RXFMCTL_FRWID_DEFAULT                      |
                                              ((object->moduleRole << 1)   & MCASP_RXFMCTL_FSRM) |
                                              ((object->invertWS   << 0)   & MCASP_RXFMCTL_FSRP));
    }

    /* Must be executed including in read-only mode */
    HWREG(I2S_BASE + MCASP_O_TXFMCTL) =  (  MCASP_TXFMCTL_XMOD_DEFAULT                       |
                                            MCASP_TXFMCTL_FXWID_DEFAULT                      |
                                          ((object->moduleRole << 1)   & MCASP_TXFMCTL_FSXM) |
                                          ((object->invertWS   << 0)   & MCASP_TXFMCTL_FSXP));
}

