nanoframework/SimpleLink_CC32xx_SDK/ti/drivers/i2s/I2SCC32XX.c
/*
 *  ======== configSerialFormat ========
 */
static void configSerialFormat(I2S_Handle handle) {

    I2SCC32XX_Object          const *object;
    I2SCC32XX_DataInterface   const *SD0;
    I2SCC32XX_DataInterface   const *SD1;

    uint8_t channelsToActivate;

    /* Get the pointer to the SD0 and SD1 interfaces*/
    object  = handle->object;
    SD0     = &object->dataInterfaceSD0;
    SD1     = &object->dataInterfaceSD1;

    /* Expected values (intermediate values are also possible):
     * dataLength = 8     >>   dataLengthCC32XX = 0x3
     * dataLength = 16    >>   dataLengthCC32XX = 0x7
     * dataLength = 24    >>   dataLengthCC32XX = 0xB
     * dataLength = 32    >>   dataLengthCC32XX = 0xF
     * */
    uint8_t dataLengthCC32XX = 1;
    int i;
    for(i=HWRESOLUTION;i<=32;i+=HWRESOLUTION){
        if(object->dataLength > i) {
            dataLengthCC32XX += HWRESOLUTION/2;
        }
    }

    if(object->noOfInputs != 0) {

        channelsToActivate = ((SD0->interfaceConfig == I2S_SD0_INPUT)? SD0->channelsUsed: 0x00) |
                             ((SD1->interfaceConfig == I2S_SD1_INPUT)? SD1->channelsUsed: 0x00);
        HWREG(I2S_BASE + MCASP_O_RXFMT) = (  MCASP_RXFMT_RDATDLY_DEFAULT                                            |
                                           ((object->isMSBFirst       << 15                 ) & MCASP_RXFMT_RRVRS ) |
                                           ((dataLengthCC32XX         << MCASP_RXFMT_RSSZ_S ) & MCASP_RXFMT_RSSZ_M) |
                                           ((object->isDMAUnused      << 3                  ) & MCASP_RXFMT_RBUSEL) |
                                           ((object->sampleRotation   << MCASP_RXFMT_RROT_S ) & MCASP_RXFMT_RROT_M));
        HWREG(I2S_BASE + MCASP_O_RXMASK) = object->sampleMask;
        HWREG(I2S_BASE + MCASP_O_RXTDM) = channelsToActivate;
    }

    /* Must be executed including in read-only mode */
    channelsToActivate = ((SD0->interfaceConfig == I2S_SD0_OUTPUT)? SD0->channelsUsed: 0x00) |
                         ((SD1->interfaceConfig == I2S_SD1_OUTPUT)? SD1->channelsUsed: 0x00);
    HWREG(I2S_BASE + MCASP_O_TXFMT) = (  MCASP_TXFMT_XDATDLY_DEFAULT                                            |
                                       ((object->isMSBFirst       << 15                 ) & MCASP_TXFMT_XRVRS ) |
                                       ((dataLengthCC32XX         << MCASP_TXFMT_XSSZ_S ) & MCASP_TXFMT_XSSZ_M) |
                                       ((object->isDMAUnused      << 3                  ) & MCASP_TXFMT_XBUSEL) |
                                       ((object->sampleRotation   << MCASP_TXFMT_XROT_S ) & MCASP_TXFMT_XROT_M));
    HWREG(I2S_BASE + MCASP_O_TXMASK) = object->sampleMask;
    HWREG(I2S_BASE + MCASP_O_TXTDM) = channelsToActivate;
}

/*
 *  ======== postNotify ========
 *  This functions is called to notify the I2S driver of an ongoing transition
 *  out of LPDS mode.
 *  clientArg should be pointing to a hardware module which has already
 *  been opened.
 */
static int postNotify(unsigned int eventType, uintptr_t eventArg, uintptr_t clientArg) {

    /* Reconfigure the hardware when returning from LPDS */
    initHw((I2S_Handle)clientArg);

    return (Power_NOTIFYDONE);
}
